export const errorMessage = {
  // 1000xx 基础组件异常
  100000: '数据库执行失败',
  100001: '数据库执行失败',
  100002: '缓存异常',
  100003: '缓存异常',
  100004: '存储网关异常',
  100005: '存储网关异常',
  100006: '消息组件异常',
  100007: '消息组件异常',
  // 1001xx 系统通用异常
  100100: '系统错误',
  100101: '系统错误',
  100102: '系统错误',
  100103: '系统错误',
  100104: '系统错误',
  // 1002xx 网络通信异常
  100200: '网络异常',
  100201: '网络异常',
  100202: '网络异常，调用外部失败',
  // 1003xx 数据处理异常
  100300: '服务处理数据异常',
  100301: '服务处理数据异常',
  // 1004xx 导入导出异常
  100400: '导出失败',
  100401: '导出失败',
  100402: '导出失败',
  // 1005xx 事件管理
  100500: '系统错误',
  100501: '系统错误',
  100502: '系统错误',
  // 1006xx 请求相关异常
  100600: '请求参数异常',
  100601: '请求协议异常',
  // 1200xx 权限管理
  120000: '角色无权限',
  120001: '用户未绑定请求角色',
  120002: '用户角色关系查询失败',
  // 1201xx 认证管理
  120100: '认证服务错误',
  120101: '登录错误',
  120102: '身份验证错误',
  120103: '登出错误',
  120104: '获取用户信息失败',
  // 1250xx 规则异常
  125000: '查询异常',
  125001: '设置异常',
  // 1251xx 席位组异常
  125100: '查询异常',
  125101: '设置异常',
  125102: '查询异常',
  125103: '设置异常',
  // 1252xx 限仓异常
  125200: '查询异常',
  125201: '设置异常',
  // 1300xx 资讯异常
  130000: '查询异常',
  130001: '资讯上场start异常',
  130002: '资讯上场end异常',
  130003: '资讯处理异常',
  // 1301xx 证券池管理异常
  130100: '查询异常',
  130101: '设置异常',
  130102: '查询异常',
  130103: '设置异常',
  130104: '查询异常',
  130105: '设置异常',
  // 1302xx 动态维度异常
  130200: '查询异常',
  130201: '设置异常',
  // 1303xx 账户异常
  130300: '查询异常',
  130301: '设置异常',
  130302: '查询异常',
  130303: '设置异常',
  130304: '账套查询异常',
  130305: '账套变更异常',
  // 1350xx 触警数据异常
  135000: '查询异常',
  135001: ' 导出异常',
  // 1400xx 节点管理
  140000: '查询异常',
  140001: '变更异常',
  // 1401xx 网关管理
  140100: '查询异常',
  140101: '变更异常',
  // 1402xx 配置管理
  140200: '配置加载异常',
  140201: '配置有误',
  // 1403xx 字典管理
  140300: ' 字典校验不通过',
  140301: ' 字典配置不存在',
  140302: '字典转换失败',
  // 1404xx 报盘代理管理
  140400: '查询异常',
  140401: '设置异常',
  // 1405xx 交易系统切日
  140500: '切日失败',
  // 1450xx 流程管理
  145000: '查询异常',
  145001: '发起异常',
  145002: '处理异常',
  // 1550xx 通用业务异常
  155000: '风控服务异常',
  155100: '调用风控核心异常',
  155200: '数据查询异常',
  155201: '业务数据处理异常',
  30000: '权限异常',
  90005: '权限异常',
};

type CodeType = keyof typeof errorMessage;
export const errCodeMessage = (code: CodeType, message?: unknown) => {
  const codeInfo = errorMessage[code];
  const messageStr = typeof message === 'string' ? message : '';

  if (codeInfo) {
    return messageStr ? `${codeInfo}: ${messageStr}` : codeInfo;
  }
  return messageStr ? messageStr : '未知错误';
};
